asker/backend/test/load/ask-random-questions.yml
config:
  target: https://5p3g3mjzm5.execute-api.us-east-1.amazonaws.com/on-aws/graphql
  plugins:
    expect: {}
  phases:
    - duration: 1
      arrivalCount: 100
  variables:
    conferenceName: load-test-7
  payload:
    path: "./questions.csv"
    fields:
      - "questionId"
      - "existentialQuestion"
    skipHeader: true
scenarios:
  - name: Create a conference for the load testing
    flow:
      - post:
          url: /
          body: '{ "query":"mutation { Ask(input: { conference:\"{{conferenceName}}\"
            question:\"{{existentialQuestion}}\" questionId:\"{{questionId}}\" who:\"alvaro@booster.cloud\"
            }) }" }'
          expect:
            - notHasProperty: errors