asker/backend/test/load/create-conference.yml
config:
  target: "https://0hxqf3hjn7.execute-api.eu-west-1.amazonaws.com/on-aws/graphql"
  plugins:
    expect: {}
  phases:
    - duration: 1
      arrivalCount: 1
  variables:
    conferenceName: "{{ $processEnvironment.CONFERENCE_NAME }}"

scenarios:
  - name: "Create a conference for the load testing"
    flow:
      - post:
          url: "/"
          body: '{
            "query":"mutation {
              CreateConference(input: {
                location: \"Canary Islands\",
                name: \"{{conferenceName}}\"
              })
            }"
          }'
          expect:
            - notHasProperty: errors